# -*- org-confirm-babel-evaluate: nil -*-
  #+title: Obsidian theme Wasp
 #+PROPERTY: header-args:css :tangle C:\Users\santi\Documents\SY Notes\Obsidian\santi-2024\.obsidian\snippets\Wasp.css :exports code :noweb yes
 

*** extras light mode
#+BEGIN_SRC css
.cm-s-obsidian span.cm-formatting-link {
    color: var(--text-normal);
}

.CodeMirror-guttermarker-subtle {
    color: var(--text-normal) !important;
}

button.mod-cta {
    background-color: var(--interactive-accent);
    color: var(--text-normal);
}

.vertical-tab-header-group-title {
    color: var(--text-white);
}
#+END_SRC

   #+RESULTS:
   #+begin_example
        .theme-light
        {
            --background-primary:         #DEDEDE;
            --background-secondary:       #C4C4C4;
             /* thick menu border */
            --background-primary-alt:     #f8c537;
            --background-secondary-alt:   #bebebe; /* ← ↓  corner */
            --text-normal:                #1A2023;
            --text-faint:                 #665c54;
            --text-title-h1:              #D49335;
            --text-title-h2:              #D49335;
            --text-title-h3:              #D49335;
            --text-title-h4:              #D49335;
            --text-title-h5:              #D49335;
            --text-link:                  #D49335;
            --text-a-hover:               #D49335;
            --text-accent-hover:          #D49335;
   /* ^^^ added for hover over bracket internal links */
            --inline-code:                #458588;
            /*  --text-mark:                  add if needed */
            --pre-code:                   #bebebe;
            /*  --text-highlight-bg:          add if needed */
            --interactive-before:         #a89984;
            --background-modifier-border: #D49335;
            --text-a:                     #961327;
            --interactive-accent:         #961327;
            --text-accent:                #961327;
            --interactive-accent-rgb:     #961327;
            --vim-cursor:                 #961327;
            --text-selection:             #EDC180;
        }
   #+end_example

